In [3]:
import pandas as pd

In [9]:
data = pd.read_csv("/Users/kellykk/Documents/Zindua/QVI_purchase_behaviour (1).csv")

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72637 entries, 0 to 72636
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   LYLTY_CARD_NBR    72637 non-null  int64
 1   LIFESTAGE         72637 non-null  object
 2   PREMIUM_CUSTOMER  72637 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [12]:
data2 = pd.read_excel("/Users/kellykk/Documents/Zindua/QVI_transaction_data.xlsx")

In [13]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264836 entries, 0 to 264835
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   DATE            264836 non-null  int64
 1   STORE_NBR       264836 non-null  int64
 2   LYLTY_CARD_NBR  264836 non-null  int64
 3   TXN_ID          264836 non-null  int64
 4   PROD_NBR        264836 non-null  int64
 5   PROD_NAME       264836 non-null  object
 6   PROD_QTY        264836 non-null  int64
 7   TOT_SALES       264836 non-null  float64
dtypes: float64(1), int64(6), object(1)
memory usage: 16.2+ MB

In [16]:
data.shape

(72637, 3)

In [17]:
data2.shape

(264836, 8)

In [18]:
data2.head()

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_NAME,PROD_QTY,TOT_SALES
0,43390,1,1000,1,5,Natural Chip Compny SeaSalt175g,2,6.0
1,43599,1,1307,348,66,CCs Nacho Cheese 175g,3,6.3
2,43605,1,1343,383,61,Smiths Crinkle Cut Chips Chicken 170g,2,2.9
3,43329,2,2373,974,69,Smiths Chip Thinly S/Cream&Onion 175g,5,15.0
4,43330,2,2426,1038,108,Kettle Tortilla ChpsHny&Jlpno Chili 150g,3,13.8

In [19]:
full_df =data.merge(data2,how='left',on='LYLTY_CARD_NBR')

In [20]:
full_df.head()

,LYLTY_CARD_NBR,LIFESTAGE,PREMIUM_CUSTOMER,DATE,STORE_NBR,TXN_ID,PROD_NBR,PROD_NAME,PROD_QTY,TOT_SALES
0,1000,YOUNG SINGLES/COUPLES,Premium,43390,1,1,5,Natural Chip Compny SeaSalt175g,2,6.0
1,1002,YOUNG SINGLES/COUPLES,Mainstream,43359,1,2,58,Red Rock Deli Chikn&Garlic Aioli 150g,1,2.7
2,1003,YOUNG FAMILIES,Budget,43531,1,3,52,Grain Waves Sour Cream&Chives 210G,1,3.6
3,1003,YOUNG FAMILIES,Budget,43532,1,4,106,Natural ChipCo Hony Soy Chckn175g,1,3.0
4,1004,OLDER SINGLES/COUPLES,Mainstream,43406,1,5,96,WW Original Stacked Chips 160g,1,1.9

what is the sales breakdown per Lifestage

In [22]:
full_df['LIFESTAGE'].nunique()

7

In [21]:
full_df.groupby('LIFESTAGE')['TOT_SALES'].sum()

LIFESTAGE
MIDAGE SINGLES/COUPLES    184751.30
NEW FAMILIES               50433.45
OLDER FAMILIES            353767.20
OLDER SINGLES/COUPLES     402426.75
RETIREES                  366470.90
YOUNG FAMILIES            316160.10
YOUNG SINGLES/COUPLES     260405.30
Name: TOT_SALES, dtype: float64

In [23]:
full_df.groupby('LIFESTAGE')['TOT_SALES'].mean()

LIFESTAGE
MIDAGE SINGLES/COUPLES    7.357678
NEW FAMILIES              7.289124
OLDER FAMILIES            7.279760
OLDER SINGLES/COUPLES     7.386823
RETIREES                  7.364325
YOUNG FAMILIES            7.252709
YOUNG SINGLES/COUPLES     7.158515
Name: TOT_SALES, dtype: float64

In [24]:
full_df.groupby('LIFESTAGE')['TOT_SALES'].max()

LIFESTAGE
MIDAGE SINGLES/COUPLES     29.5
NEW FAMILIES               27.0
OLDER FAMILIES            650.0
OLDER SINGLES/COUPLES      29.5
RETIREES                   29.5
YOUNG FAMILIES             29.5
YOUNG SINGLES/COUPLES      27.0
Name: TOT_SALES, dtype: float64

In [25]:
full_df.groupby('PREMIUM_CUSTOMER')['TOT_SALES'].sum()

PREMIUM_CUSTOMER
Budget        676211.55
Mainstream    750744.50
Premium       507458.95
Name: TOT_SALES, dtype: float64

In [26]:
full_df.groupby('PREMIUM_CUSTOMER')['TOT_SALES'].max()

PREMIUM_CUSTOMER
Budget         29.5
Mainstream     29.5
Premium       650.0
Name: TOT_SALES, dtype: float64

In [28]:
full_df.groupby(['PREMIUM_CUSTOMER','LIFESTAGE'])['TOT_SALES'].max()

PREMIUM_CUSTOMER  LIFESTAGE
Budget            MIDAGE SINGLES/COUPLES     28.5
                  NEW FAMILIES               27.0
                  OLDER FAMILIES             28.5
                  OLDER SINGLES/COUPLES      28.5
                  RETIREES                   28.5
                  YOUNG FAMILIES             29.5
                  YOUNG SINGLES/COUPLES      27.0
Mainstream        MIDAGE SINGLES/COUPLES     29.5
                  NEW FAMILIES               23.0
                  OLDER FAMILIES             29.5
                  OLDER SINGLES/COUPLES      28.5
                  RETIREES                   29.5
                  YOUNG FAMILIES             28.5
                  YOUNG SINGLES/COUPLES      27.0
Premium           MIDAGE SINGLES/COUPLES     28.5
                  NEW FAMILIES               23.0
                  OLDER FAMILIES            650.0
                  OLDER SINGLES/COUPLES      29.5
                  RETIREES                   29.5
                  YOUNG FAMILIES             25.5
                  YOUNG SINGLES/COUPLES      21.6
Name: TOT_SALES, dtype: float64

pivot table

In [31]:
full_df.pivot_table(index='LIFESTAGE',columns='PREMIUM_CUSTOMER',values='TOT_SALES',aggfunc='std')

PREMIUM_CUSTOMER          Budget  Mainstream   Premium
LIFESTAGE
MIDAGE SINGLES/COUPLES  2.559098    2.456139  2.577943
NEW FAMILIES            2.558088    2.569146  2.541616
OLDER FAMILIES          2.501890    2.474379  8.942973
OLDER SINGLES/COUPLES   2.497387    2.525480  2.507484
RETIREES                2.535836    2.530731  2.512946
YOUNG FAMILIES          2.497295    2.476953  2.476317
YOUNG SINGLES/COUPLES   2.687320    2.507767  2.693410

In [32]:
full_df.pivot_table(index='LIFESTAGE',columns='PREMIUM_CUSTOMER',values='TOT_SALES',aggfunc='sum')

PREMIUM_CUSTOMER           Budget  Mainstream    Premium
LIFESTAGE
MIDAGE SINGLES/COUPLES   35514.80    90803.85   58432.65
NEW FAMILIES             21928.45    17013.90   11491.10
OLDER FAMILIES          168363.25   103445.55   81958.40
OLDER SINGLES/COUPLES   136769.80   133393.80  132263.15
RETIREES                113147.80   155677.05   97646.05
YOUNG FAMILIES          139345.85    92788.75   84025.50
YOUNG SINGLES/COUPLES    61141.60   157621.60   41642.10

In [33]:
full_df.pivot_table(index='LIFESTAGE',columns='PREMIUM_CUSTOMER',values='TOT_SALES',aggfunc='mean')

PREMIUM_CUSTOMER          Budget  Mainstream   Premium
LIFESTAGE
MIDAGE SINGLES/COUPLES  7.074661    7.647284  7.112056
NEW FAMILIES            7.297321    7.317806  7.231655
OLDER FAMILIES          7.269570    7.262395  7.322945
OLDER SINGLES/COUPLES   7.430315    7.282116  7.449766
RETIREES                7.443445    7.252262  7.456174
YOUNG FAMILIES          7.287201    7.189025  7.266756
YOUNG SINGLES/COUPLES   6.615624    7.558339  6.629852

In [34]:
full_df.groupby(index='LIFESTAGE',columns='PREMIUM_CUSTOMER',values='TOT_SALES',aggfunc='std')

TypeError: DataFrame.groupby() got an unexpected keyword argument 'index'

In [35]:
full_df.groupby(['PREMIUM_CUSTOMER','LIFESTAGE'])['TOT_SALES']),aggfunc='std')

SyntaxError: unmatched ')' (1610253070.py, line 1)